KanatERPSukhova.КанатАдаптация/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="877a04b6-4c0b-4715-b826-6ac77909e040">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes>
    <name>КАНАТ_ДанныеДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Подписант</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="79835be6-c08e-48a0-851c-e3c4da4d8a47">
    <name>ДатаПрекращенияСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fad70dd9-2de6-4bf6-8dbb-73c8ae806377">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29f8edc3-bc77-4470-9bc6-b58b2924f54d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="2f4a3620-e144-45ef-983d-c08853b9c00d">
    <name>РолиКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3e546e08-a859-49f2-9d04-c9fdb5547183">
      <name>РольКонтактногоЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/КонтактныеЛицаПартнеров/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Байков ++ 23.08.23  ЧТЗ 2_5
		НовыйЭлемент = Элементы.Добавить("КАНАТ_ДанныеДоверенности",Тип("ПолеФормы"), Элементы.ГруппаОсновныеСведения);
	    НовыйЭлемент.ПутьКДанным = "объект.КАНАТ_ДанныеДоверенности";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Данные доверенности";
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	//БИТ_Байков -
	
	//БИТ_Гурьев__22.03.24++
	ЭлементПодписант = Элементы.Добавить("КАНАТ_Подписант", Тип("ПолеФормы"), Элементы.ГруппаОсновныеСведения);
	ЭлементПодписант.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПодписант.ПутьКДанным = "Объект.КАНАТ_Подписант";
	ЭлементПодписант.Заголовок = "Подписант";
	//БИТ_Гурьев__22.03.24--
КонецПроцедуры

//БИТ_Гурьев__22.03.24++
&НаСервере
Процедура КАНАТ_УдалитьДругихПодписантов()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	               |ГДЕ
	               |	КонтактныеЛицаПартнеров.Владелец = &Владелец
	               |	И КонтактныеЛицаПартнеров.КАНАТ_Подписант = ИСТИНА
	               |	И КонтактныеЛицаПартнеров.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КонтактноеЛицоОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонтактноеЛицоОбъект.КАНАТ_Подписант = Ложь;
		КонтактноеЛицоОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры //БИТ_Гурьев__22.03.24--

&НаСервере
Процедура КАНАТ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.КАНАТ_Подписант Тогда
		
		КАНАТ_УдалитьДругихПодписантов();
		
	КонецЕсли;
КонецПроцедуры
